khoih-prog/WiFiManager_Generic_Lite/src/WiFiManager_Generic_Lite_RP2040.h
#warning Using arduino-pico core
    // For boards using arduino-pico core
    // Already defined in DoubleResetDetector_Generic.h
    // FS* filesystem =      &LittleFS;
    // #define FileFS        LittleFS

    //#define SEEK_SET        SeekSet

    void saveForcedCP(const uint32_t& value)
    {
      // Mbed RP2040 code
      File file = filesystem->open(CONFIG_PORTAL_FILENAME, "w");

      WG_LOGERROR(F("SaveCPFile "));

      if (file)
      {
        file.seek(0, SeekSet);
        file.write((uint8_t *) &value, sizeof(value));
        file.close();

        WG_LOGERROR(F("OK"));
      }
      else
      {
        WG_LOGERROR(F("failed"));
      }

      // Trying open redundant CP file
      file = filesystem->open(CONFIG_PORTAL_FILENAME_BACKUP, "w");

      WG_LOGERROR(F("SaveBkUpCPFile "));

      if (file)
      {
        file.seek(0, SeekSet);
        file.write((uint8_t *) &value, sizeof(value));
        file.close();

        WG_LOGERROR(F("OK"));
      }
      else
      {
        WG_LOGERROR(F("failed"));
      }
    }

    //////////////////////////////////////////////

    void setForcedCP(const bool& isPersistent)
    {
      uint32_t readForcedConfigPortalFlag = isPersistent ? FORCED_PERS_CONFIG_PORTAL_FLAG_DATA :
                                            FORCED_CONFIG_PORTAL_FLAG_DATA;

      WG_LOGERROR(isPersistent ? F("setForcedCP Persistent") : F("setForcedCP non-Persistent"));

      saveForcedCP(readForcedConfigPortalFlag);
    }

    //////////////////////////////////////////////

    void clearForcedCP()
    {
      uint32_t readForcedConfigPortalFlag = 0;

      WG_LOGERROR(F("clearForcedCP"));

      saveForcedCP(readForcedConfigPortalFlag);
    }

    //////////////////////////////////////////////

    bool isForcedCP()
    {
      uint32_t readForcedConfigPortalFlag;

      WG_LOGDEBUG(F("Check if isForcedCP"));

      File file = filesystem->open(CONFIG_PORTAL_FILENAME, "r");

      WG_LOGDEBUG(F("LoadCPFile "));

      if (!file)
      {
        WG_LOGDEBUG(F("failed"));

        // Trying open redundant config file
        file = filesystem->open(CONFIG_PORTAL_FILENAME_BACKUP, "r");

        WG_LOGDEBUG(F("LoadBkUpCPFile "));

        if (!file)
        {
          WG_LOGDEBUG(F("failed"));
          return false;
        }
      }

      file.seek(0, SeekSet);
      file.read((uint8_t *) &readForcedConfigPortalFlag, sizeof(readForcedConfigPortalFlag));
      file.close();
      WG_LOGDEBUG(F("OK"));


      // Return true if forced CP (0xDEADBEEF read at offset EPROM_START + DRD_FLAG_DATA_SIZE + CONFIG_DATA_SIZE)
      // => set flag noForcedConfigPortal = false
      if (readForcedConfigPortalFlag == FORCED_CONFIG_PORTAL_FLAG_DATA)
      {
        persForcedConfigPortal = false;
        return true;
      }
      else if (readForcedConfigPortalFlag == FORCED_PERS_CONFIG_PORTAL_FLAG_DATA)
      {
        persForcedConfigPortal = true;
        return true;
      }
      else
      {
        return false;
      }
    }

    //////////////////////////////////////////////

#if USE_DYNAMIC_PARAMETERS

    bool checkDynamicData()
    {
      int checkSum = 0;
      int readCheckSum;
      char* readBuffer = nullptr;

      File file = filesystem->open(CREDENTIALS_FILENAME, "r");

      WG_LOGDEBUG(F("LoadCredFile "));

      if (!file)
      {
        WG_LOGDEBUG(F("failed"));

        // Trying open redundant config file
        file = filesystem->open(CREDENTIALS_FILENAME_BACKUP, "r");

        WG_LOGDEBUG(F("LoadBkUpCredFile "));

        if (!file)
        {
          WG_LOGDEBUG(F("failed"));
          return false;
        }
      }

      // Find the longest pdata, then dynamically allocate buffer. Remember to free when done
      // This is used to store tempo data to calculate checksum to see of data is valid
      // We dont like to destroy myMenuItems[i].pdata with invalid data

      uint16_t maxBufferLength = 0;

      for (uint16_t i = 0; i < NUM_MENU_ITEMS; i++)
      {
        if (myMenuItems[i].maxlen > maxBufferLength)
          maxBufferLength = myMenuItems[i].maxlen;
      }

      if (maxBufferLength > 0)
      {
        readBuffer = new char[ maxBufferLength + 1 ];

        // check to see NULL => stop and return false
        if (readBuffer == NULL)
        {
          WG_LOGERROR(F("ChkCrR: Error can't allocate buffer."));
          return false;
        }
        else
        {
          WG_LOGDEBUG1(F("ChkCrR: Buffer allocated, Sz="), maxBufferLength + 1);
        }

        uint16_t offset = 0;

        for (uint16_t i = 0; i < NUM_MENU_ITEMS; i++)
        {
          uint8_t * _pointer = (uint8_t *) readBuffer;

          // Actual size of pdata is [maxlen + 1]
          memset(readBuffer, 0, myMenuItems[i].maxlen + 1);

          // Redundant, but to be sure correct position
          file.seek(offset, SeekSet);
          file.read(_pointer, myMenuItems[i].maxlen);

          offset += myMenuItems[i].maxlen;

          WG_LOGDEBUG3(F("ChkCrR:pdata="), readBuffer, F(",len="), myMenuItems[i].maxlen);

          for (uint16_t j = 0; j < myMenuItems[i].maxlen; j++, _pointer++)
          {
            checkSum += *_pointer;
          }
        }

        file.read((uint8_t *) &readCheckSum, sizeof(readCheckSum));

        WG_LOGDEBUG(F("OK"));

        file.close();

        WG_LOGERROR3(F("CrCCsum=0x"), String(checkSum, HEX), F(",CrRCsum=0x"), String(readCheckSum, HEX));

        if (readBuffer != nullptr)
        {
          // Free buffer
          delete [] readBuffer;
          WG_LOGDEBUG(F("Buffer freed"));
        }

        if ( checkSum == readCheckSum)
        {
          return true;
        }
      }

      return false;
    }

    //////////////////////////////////////////////

    bool loadDynamicData()
    {
      int checkSum = 0;
      int readCheckSum;
      totalDataSize = sizeof(WIFI_GENERIC_config) + sizeof(readCheckSum);

      File file = filesystem->open(CREDENTIALS_FILENAME, "r");

      WG_LOGDEBUG(F("LoadCredFile "));

      if (!file)
      {
        WG_LOGDEBUG(F("failed"));

        // Trying open redundant config file
        file = filesystem->open(CREDENTIALS_FILENAME_BACKUP, "r");

        WG_LOGDEBUG(F("LoadBkUpCredFile "));

        if (!file)
        {
          WG_LOGDEBUG(F("failed"));
          return false;
        }
      }

