khoih-prog/WiFiManager_Generic_Lite/src/WiFiManager_Generic_Lite_RP2040.h
      uint16_t offset = 0;

      for (uint16_t i = 0; i < NUM_MENU_ITEMS; i++)
      {
        uint8_t * _pointer = (uint8_t *) myMenuItems[i].pdata;
        totalDataSize += myMenuItems[i].maxlen;

        // Actual size of pdata is [maxlen + 1]
        memset(myMenuItems[i].pdata, 0, myMenuItems[i].maxlen + 1);

        // Redundant, but to be sure correct position
        file.seek(offset, SeekSet);
        file.read(_pointer, myMenuItems[i].maxlen);

        offset += myMenuItems[i].maxlen;

        WG_LOGDEBUG3(F("CrR:pdata="), myMenuItems[i].pdata, F(",len="), myMenuItems[i].maxlen);

        for (uint16_t j = 0; j < myMenuItems[i].maxlen; j++, _pointer++)
        {
          checkSum += *_pointer;
        }
      }

      file.read((uint8_t *) &readCheckSum, sizeof(readCheckSum));

      WG_LOGDEBUG(F("OK"));

      file.close();

      WG_LOGDEBUG3(F("CrCCsum=0x"), String(checkSum, HEX), F(",CrRCsum=0x"), String(readCheckSum, HEX));

      if ( checkSum != readCheckSum)
      {
        return false;
      }

      return true;
    }

    //////////////////////////////////////////////

    void saveDynamicData()
    {
      int checkSum = 0;

      File file = filesystem->open(CREDENTIALS_FILENAME, "w");

      WG_LOGDEBUG(F("SaveCredFile "));

      uint16_t offset = 0;

      for (uint16_t i = 0; i < NUM_MENU_ITEMS; i++)
      {
        uint8_t* _pointer = (uint8_t *) myMenuItems[i].pdata;

        WG_LOGDEBUG3(F("CW1:pdata="), myMenuItems[i].pdata, F(",len="), myMenuItems[i].maxlen);

        if (file)
        {
          // Redundant, but to be sure correct position
          file.seek(offset, SeekSet);
          file.write(_pointer, myMenuItems[i].maxlen);

          offset += myMenuItems[i].maxlen;
        }
        else
        {
          WG_LOGDEBUG(F("failed"));
        }

        for (uint16_t j = 0; j < myMenuItems[i].maxlen; j++, _pointer++)
        {
          checkSum += *_pointer;
        }
      }

      if (file)
      {
        file.write((uint8_t *) &checkSum, sizeof(checkSum));
        file.close();

        WG_LOGDEBUG(F("OK"));
      }
      else
      {
        WG_LOGDEBUG(F("failed"));
      }

      WG_LOGDEBUG1(F("CrWCSum=0x"), String(checkSum, HEX));

      // Trying open redundant Auth file
      file = filesystem->open(CREDENTIALS_FILENAME_BACKUP, "w");

      WG_LOGDEBUG(F("SaveBkUpCredFile "));

      offset = 0;

      for (uint16_t i = 0; i < NUM_MENU_ITEMS; i++)
      {
        uint8_t* _pointer = (uint8_t *) myMenuItems[i].pdata;

        WG_LOGDEBUG3(F("CW2:pdata="), myMenuItems[i].pdata, F(",len="), myMenuItems[i].maxlen);

        if (file)
        {
          file.seek(offset, SeekSet);
          file.write(_pointer, myMenuItems[i].maxlen);

          // Redundant, but to be sure correct position
          offset += myMenuItems[i].maxlen;
        }
        else
        {
          WG_LOGDEBUG(F("failed"));
        }

        for (uint16_t j = 0; j < myMenuItems[i].maxlen; j++, _pointer++)
        {
          checkSum += *_pointer;
        }
      }

      if (file)
      {
        file.write((uint8_t *) &checkSum, sizeof(checkSum));
        file.close();

        WG_LOGDEBUG(F("OK"));
      }
      else
      {
        WG_LOGDEBUG(F("failed"));
      }
    }
#endif

    //////////////////////////////////////////////

    bool loadConfigData()
    {
      WG_LOGDEBUG(F("LoadCfgFile "));

      // file existed
      File file = filesystem->open(CONFIG_FILENAME, "r");

      if (!file)
      {
        WG_LOGDEBUG(F("failed"));

        // Trying open redundant config file
        file = filesystem->open(CONFIG_FILENAME_BACKUP, "r");

        WG_LOGDEBUG(F("LoadBkUpCfgFile "));

        if (!file)
        {
          WG_LOGDEBUG(F("failed"));
          return false;
        }
      }

      file.seek(0, SeekSet);
      file.read((uint8_t *) &WIFI_GENERIC_config, sizeof(WIFI_GENERIC_config));
      file.close();

      WG_LOGDEBUG(F("OK"));

      return isWiFiConfigValid();
    }

    //////////////////////////////////////////////

    void saveConfigData()
    {
      WG_LOGDEBUG(F("SaveCfgFile "));

      int calChecksum = calcChecksum();
      WIFI_GENERIC_config.checkSum = calChecksum;
      WG_LOGDEBUG1(F("WCSum=0x"), String(calChecksum, HEX));

      File file = filesystem->open(CONFIG_FILENAME, "w");

      if (file)
      {
        file.seek(0, SeekSet);
        file.write((uint8_t *) &WIFI_GENERIC_config, sizeof(WIFI_GENERIC_config));
        file.close();

        WG_LOGDEBUG(F("OK"));
      }
      else
      {
        WG_LOGDEBUG(F("failed"));
      }

      WG_LOGDEBUG(F("SaveBkUpCfgFile "));

      // Trying open redundant Auth file
      file = filesystem->open(CONFIG_FILENAME_BACKUP, "w");

      if (file)
      {
        file.seek(0, SeekSet);
        file.write((uint8_t *) &WIFI_GENERIC_config, sizeof(WIFI_GENERIC_config));
        file.close();

        WG_LOGDEBUG(F("OK"));
      }
      else
      {
        WG_LOGDEBUG(F("failed"));
      }

#if USE_DYNAMIC_PARAMETERS
      saveDynamicData();
#endif

#if (USE_WIFI_NINA || USE_WIFI101)
      wifiMulti_addAP();
#endif
    }

    //////////////////////////////////////////////

#endif    // #if defined(ARDUINO_ARCH_MBED)

    //////////////////////////////////////////////

    void NULLTerminateConfig()
    {
      //#define HEADER_MAX_LEN      16
      //#define SERVER_MAX_LEN      32
      //#define TOKEN_MAX_LEN       36

      // NULL Terminating to be sure
      WIFI_GENERIC_config.header[HEADER_MAX_LEN - 1] = 0;
      WIFI_GENERIC_config.WiFi_Creds[0].wifi_ssid[SSID_MAX_LEN - 1] = 0;
      WIFI_GENERIC_config.WiFi_Creds[0].wifi_pw  [PASS_MAX_LEN - 1] = 0;
      WIFI_GENERIC_config.WiFi_Creds[1].wifi_ssid[SSID_MAX_LEN - 1] = 0;
      WIFI_GENERIC_config.WiFi_Creds[1].wifi_pw  [PASS_MAX_LEN - 1] = 0;
      WIFI_GENERIC_config.board_name[BOARD_NAME_MAX_LEN - 1]  = 0;
    }

    //////////////////////////////////////////////

    bool isWiFiConfigValid()
    {
#if REQUIRE_ONE_SET_SSID_PW

