khoih-prog/WiFiManager_Generic_Lite/src/WiFiManager_Generic_Lite_RP2040.h
          for (uint16_t i = 0; i < NUM_MENU_ITEMS; i++)
          {
            strncpy(myMenuItems[i].pdata, WM_NO_CONFIG, myMenuItems[i].maxlen);
          }

#endif
        }

        strcpy(WIFI_GENERIC_config.header, WIFI_GENERIC_BOARD_TYPE);

#if USE_DYNAMIC_PARAMETERS

        for (uint16_t i = 0; i < NUM_MENU_ITEMS; i++)
        {
          WG_LOGDEBUG3(F("g:myMenuItems["), i, F("]="), myMenuItems[i].pdata );
        }

#endif

        // Don't need
        WIFI_GENERIC_config.checkSum = 0;

        saveConfigData();

        return false;
      }
      else if ( !isWiFiConfigValid() )
      {
        // If SSID, PW ="blank" or NULL, stay in config mode forever until having config Data.
        return false;
      }
      else
      {
        displayConfigData(WIFI_GENERIC_config);
      }

      return true;
    }

    //////////////////////////////////////////////

#if (USE_WIFI_NINA || USE_WIFI101)

    bool connectMultiWiFi(int retry_time)
    {
      // For general board, this better be 1000 to enable connect the 1st time
#define WIFI_MULTI_1ST_CONNECT_WAITING_MS             1000L

#define WIFI_MULTI_CONNECT_WAITING_MS                   500L

      WG_LOGDEBUG("No WiFi. Trying to scan and reconnect");

      WiFi.disconnect();

      int i = 0;

      uint8_t status = wifiMulti.run();

      delay(WIFI_MULTI_1ST_CONNECT_WAITING_MS);

      while ( ( i++ < (retry_time * 5) ) && ( status != WL_CONNECTED ) )
      {
        status = WiFi.status();

        if ( status == WL_CONNECTED )
          break;
        else
          delay(WIFI_MULTI_CONNECT_WAITING_MS);
      }

      if ( status == WL_CONNECTED )
      {
        WG_LOGERROR1(F("WiFi connected after time: "), i);
        WG_LOGERROR3(F("SSID:"), WiFi.SSID(), F(",RSSI="), WiFi.RSSI());

#if (defined(ESP32) || defined(ESP8266))
        WG_LOGERROR3(F("Channel:"), WiFi.channel(), F(",IP address:"), WiFi.localIP() );
#else
        WG_LOGERROR1(F("IP address:"), WiFi.localIP() );
#endif
      }
      else
      {
        WG_LOGERROR(F("WiFi not connected"));

        if (wifiMulti.run() != WL_CONNECTED)
        {
          Serial.println("WiFi not connected!");
          delay(1000);
        }
      }

      return (status == WL_CONNECTED);
    }

#else

    //////////////////////////////////////////////

    // Max times to try WiFi per loop() iteration. To avoid blocking issue in loop()
    // Default 1 and minimum 1.
#if !defined(MAX_NUM_WIFI_RECON_TRIES_PER_LOOP)
#define MAX_NUM_WIFI_RECON_TRIES_PER_LOOP     1
#else
#if (MAX_NUM_WIFI_RECON_TRIES_PER_LOOP < 1)
#define MAX_NUM_WIFI_RECON_TRIES_PER_LOOP     1
#endif
#endif

    // New connection logic from v1.2.0
    bool connectMultiWiFi(int retry_time)
    {
      int sleep_time  = 250;
      int index       = 0;
      int new_index   = 0;
      uint8_t status  = WL_IDLE_STATUS;

      static int lastConnectedIndex = 255;

      WG_LOGDEBUG(F("ConMultiWifi"));

      if (static_IP != IPAddress(0, 0, 0, 0))
      {
        WG_LOGDEBUG(F("UseStatIP"));
        WiFi.config(static_IP);
      }

      if (lastConnectedIndex != 255)
      {
        //  Successive connection, index = ??
        // Checking if new_index is OK
        new_index = (lastConnectedIndex + 1) % NUM_WIFI_CREDENTIALS;

        if ( strlen(WIFI_GENERIC_config.WiFi_Creds[new_index].wifi_pw) >= PASSWORD_MIN_LEN )
        {
          index = new_index;
          WG_LOGDEBUG3(F("Using index="), index, F(", lastConnectedIndex="), lastConnectedIndex);
        }
        else
        {
          WG_LOGERROR3(F("Ignore invalid WiFi PW : index="), new_index, F(", PW="),
                       WIFI_GENERIC_config.WiFi_Creds[new_index].wifi_pw);

          // Using the previous valid index
          index = lastConnectedIndex;
        }
      }
      else
      {
        //  First connection ever, index = 0
        if ( strlen(WIFI_GENERIC_config.WiFi_Creds[0].wifi_pw) >= PASSWORD_MIN_LEN )
        {
          WG_LOGDEBUG(F("First connection, Using index=0"));
        }
        else
        {
          WG_LOGERROR3(F("Ignore invalid WiFi PW : index=0, SSID="), WIFI_GENERIC_config.WiFi_Creds[0].wifi_ssid,
                       F(", PWD="), WIFI_GENERIC_config.WiFi_Creds[0].wifi_pw);

          // Using the next valid index
          index = 1;
        }
      }

      WG_LOGERROR3(F("con2WF:SSID="), WIFI_GENERIC_config.WiFi_Creds[index].wifi_ssid,
                   F(",PW="), WIFI_GENERIC_config.WiFi_Creds[index].wifi_pw);

      uint8_t numIndexTried = 0;

      uint8_t numWiFiReconTries = 0;

      while ( !wifi_connected && (numIndexTried++ < NUM_WIFI_CREDENTIALS)
              && (numWiFiReconTries++ < MAX_NUM_WIFI_RECON_TRIES_PER_LOOP) )
      {
        while ( 0 < retry_time )
        {
          WG_LOGDEBUG1(F("Remaining retry_time="), retry_time);

          status = WiFi.begin(WIFI_GENERIC_config.WiFi_Creds[index].wifi_ssid, WIFI_GENERIC_config.WiFi_Creds[index].wifi_pw);

          // Need restart WiFi at beginning of each cycle
          if (status == WL_CONNECTED)
          {
            wifi_connected = true;
            lastConnectedIndex = index;
            WG_LOGDEBUG1(F("WOK, lastConnectedIndex="), lastConnectedIndex);

            break;
          }
          else
          {
            delay(sleep_time);
            retry_time--;
          }
        }

        if (status == WL_CONNECTED)
        {
          break;
        }
        else
        {
          if (retry_time <= 0)
          {
            WG_LOGERROR3(F("Failed using index="), index, F(", retry_time="), retry_time);
            retry_time = RETRY_TIMES_CONNECT_WIFI;
          }

          new_index = (index + 1) % NUM_WIFI_CREDENTIALS;

          // only use new index if valid (len >= PASSWORD_MIN_LEN = 8)
          if ( strlen(WIFI_GENERIC_config.WiFi_Creds[new_index].wifi_pw) >= PASSWORD_MIN_LEN )
          {
            index = new_index;
          }

          //WiFi.end();
        }
      }

      if (wifi_connected)
      {
        WG_LOGERROR(F("con2WF:OK"));

        WG_LOGERROR1(F("IP="), WiFi.localIP() );

        displayWiFiData();
      }
      else
      {
        WG_LOGERROR(F("con2WF:failed"));
        // Can't connect, so try another index next time. Faking this index is OK and lost
        lastConnectedIndex = index;
      }

      return wifi_connected;
    }

#endif

    //////////////////////////////////////////////

    // NEW
    void createHTML(String& root_html_template)
    {
      String pitem;

      root_html_template  = WIFI_GENERIC_HTML_HEAD_START;

